src/main/resources/xml/accommodationSalesComponentServicePort/unshareAccommodations/unshareAccommodations.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ejb="http://ejb.service.resmanagement.wdw.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <ejb:unshareAccommodations>
         <request>
            <shareChains/>
            <unsharedAccommodations>
               <unSharedRoomDetail>
                  <bookingDate>?</bookingDate>
                     <guaranteeStatus>?</guaranteeStatus>
                     <overideFreeze>?</overideFreeze>
                     <packageCode>?</packageCode>
                     <rateDetails>
                        <additionalCharge>?</additionalCharge>
                        <additionalChargeOverridden>?</additionalChargeOverridden>
                        <basePrice>?</basePrice>
                        <date>?</date>
                        <dayCount>?</dayCount>
                        <overidden>?</overidden>
                        <shared>?</shared>
                        <netPrice>?</netPrice>
                        <pointsValue>?</pointsValue>
                     </rateDetails>
                     <resortCode>?</resortCode>
                     <resortPeriod>
                        <endDate>?</endDate>
                        <startDate>?</startDate>
                     </resortPeriod>
                     <roomReservationDetail>
                        <guestReferenceDetails>
                           <age>?</age>
                           <ageType>?</ageType>
                           <guest>
                              <firstName>?</firstName>
                              <lastName>?</lastName>
                              <middleName>?</middleName>
                              <partyId>?</partyId>
                              <phoneDetails>
                           <locatorId>?</locatorId>
                           <guestLocatorId>?</guestLocatorId>
                           <locatorUseType>?</locatorUseType>
                           <primary>?</primary>
                           <deviceType>?</deviceType>
                           <extension>?</extension>
                           <number>?</number>
                        </phoneDetails>
                        <addressDetails>
                           <locatorId>?</locatorId>
                           <guestLocatorId>?</guestLocatorId>
                           <primary>?</primary>
                           <addressLine1>?</addressLine1>
                           <city>?</city>
                           <country>?</country>
                           <postalCode>?</postalCode>
                           <state>?</state>
                           <regionName>?</regionName>
                        </addressDetails>
                        <emailDetails>
                           <locatorId>?</locatorId>
                           <guestLocatorId>?</guestLocatorId>
                           <primary>?</primary>
                           <address>?</address>
                        </emailDetails>
                              <doNotMailIndicator>?</doNotMailIndicator>
                              <doNotPhoneIndicator>?</doNotPhoneIndicator>
                              <dclGuestId>?</dclGuestId>
                              <guestId>?</guestId>
                              <active>?</active>
                           </guest>
                           <purposeOfVisit>?</purposeOfVisit>
                           <correlationID>?</correlationID>
                        </guestReferenceDetails>
                     </roomReservationDetail>
                     <roomTypeCode>?</roomTypeCode>
                     <rsrReservation>?</rsrReservation>
                     <travelComponentGroupingId>?</travelComponentGroupingId>
                     <travelComponentId>?</travelComponentId>
                     <travelStatus>?</travelStatus>
                     <shared>?</shared>
               </unSharedRoomDetail>
			   <travelPlanSegmentId>?</travelPlanSegmentId>
               <unSharedRoomDetail>
                  <bookingDate>?</bookingDate>
                     <guaranteeStatus>?</guaranteeStatus>
                     <overideFreeze>?</overideFreeze>
                     <packageCode>?</packageCode>
                     <rateDetails>
                        <additionalCharge>?</additionalCharge>
                        <additionalChargeOverridden>?</additionalChargeOverridden>
                        <basePrice>?</basePrice>
                        <date>?</date>
                        <dayCount>?</dayCount>
                        <overidden>?</overidden>
                        <shared>?</shared>
                        <netPrice>?</netPrice>
                        <pointsValue>?</pointsValue>
                     </rateDetails>
                     <resortCode>?</resortCode>
                     <resortPeriod>
                        <endDate>?</endDate>
                        <startDate>?</startDate>
                     </resortPeriod>
                     <roomReservationDetail>
                        <guestReferenceDetails>
                           <age>?</age>
                           <ageType>?</ageType>
                           <guest>
                              <firstName>?</firstName>
                              <lastName>?</lastName>
                              <middleName>?</middleName>
                              <partyId>?</partyId>
                              <phoneDetails>
                           <locatorId>?</locatorId>
                           <guestLocatorId>?</guestLocatorId>
                           <locatorUseType>?</locatorUseType>
                           <primary>?</primary>
                           <deviceType>?</deviceType>
                           <extension>?</extension>
                           <number>?</number>
                        </phoneDetails>
                        <addressDetails>
                           <locatorId>?</locatorId>
                           <guestLocatorId>?</guestLocatorId>
                           <primary>?</primary>
                           <addressLine1>?</addressLine1>
                           <city>?</city>
                           <country>?</country>
                           <postalCode>?</postalCode>
                           <state>?</state>
                           <regionName>?</regionName>
                        </addressDetails>
                        <emailDetails>
                           <locatorId>?</locatorId>
                           <guestLocatorId>?</guestLocatorId>
                           <primary>?</primary>
                           <address>?</address>
                        </emailDetails>

                              <doNotMailIndicator>?</doNotMailIndicator>
                              <doNotPhoneIndicator>?</doNotPhoneIndicator>
                              <dclGuestId>?</dclGuestId>
                              <guestId>?</guestId>
                              <active>?</active>
                           </guest>
                           <purposeOfVisit>?</purposeOfVisit>
                           <correlationID>?</correlationID>
                        </guestReferenceDetails>
                     </roomReservationDetail>
                     <roomTypeCode>?</roomTypeCode>
                     <rsrReservation>?</rsrReservation>
                     <travelComponentGroupingId>?</travelComponentGroupingId>
                     <travelComponentId>?</travelComponentId>
                     <travelStatus>?</travelStatus>
                     <shared>?</shared>
               </unSharedRoomDetail>
			   <travelPlanSegmentId>?</travelPlanSegmentId>
            </unsharedAccommodations>
         </request>
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </ejb:unshareAccommodations>
   </soapenv:Body>
</soapenv:Envelope>


